Autodesk.Revit.Creation.Document.NewElectricalSystem(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Electrical.ElectricalSystemType)
Creates a new MEP Electrical System element from a set of electrical components.
electComponents: The electrical components in this system.
elecSysType: The System Type of electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified parameter Value is null.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the elecSysType parameter Value is out of the range of ElectricalSystemType.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the electrical system cannot be created by these input electrical components.
Returns:  If successful a new MEP Electrical System element within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewElectricalSystem(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Electrical.ElectricalSystemType)
Creates a new MEP Electrical System element.
Creates a new MEP Electrical System element from an unused Connector.
connector: The Connector to create this Electrical System.
elecSysType: The System Type of electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified parameter Value is null.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the elecSysType parameter Value is out of the range of ElectricalSystemType.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the electrical system cannot be created by these input connector.
Returns:  If successful a new MEP Electrical System element within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewExtrusionRoof(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.ReferencePlane,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.RoofType,System.Double,System.Double)
Creates a new Extrusion Roof.
profile: The profile of the extrusion roof.
refPlane: The work plane for the extrusion roof.
level: The level of the extrusion roof.
roofType: Type of the extrusion roof.
extrusionStart: Start the extrusion.
extrusionEnd: End the extrusion.
Remarks:  This method will regenerate the document even in manual regeneration mode.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the work plane does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the roof type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewTag(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,System.Boolean,Autodesk.Revit.DB.TagMode,Autodesk.Revit.DB.TagOrientation,Autodesk.Revit.DB.XYZ)
Creates a new IndependentTag Element.
dbview:  The view in which the tag is to be visible.
elemToTag:  The host object of tag.
addLeader:  Whether there will be a leader.
tagMode:  The mode of the tag. Add by Category, add by Multi-Category, or add by material.
tagOrientation:  The orientation of the tag.
pnt:  If not using a leader, this is the position of the tag head.  If using a leader, then the tag will be placed with the default leader length as close to this input point as possible.
Returns:  If successful, an IndependentTag object is returned.
Remarks:  This method forms a tag relationship to the host object.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the view is a perspective view.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the element to tag does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the view does not exist in the given document.